[
  {
    "id": "email_001",
    "fromName": "Dr. James Wilson",
    "fromEmail": "warmmilk21@gmail.com",
    "subject": "Inquiry about AI Epic™ Co-Ablation System Probe Specifications",
    "content": "Dear Sales Team,\n\nI am Dr. James Wilson, Chief of Interventional Oncology at Metropolitan Medical Center. We are currently evaluating cryoablation systems for our expanding tumor ablation program.\n\nI have some specific questions about your AI Epic™ Co-Ablation System:\n\n1. What are the available probe diameters and lengths? We primarily treat liver and kidney tumors ranging from 2-5cm.\n\n2. Can you provide details about the temperature range and ice ball formation characteristics?\n\n3. What imaging modalities are compatible with your system? We primarily use CT and MRI guidance.\n\n4. Do you have clinical data comparing outcomes with traditional argon-helium systems?\n\n5. What is the typical procedure time for a 3cm liver lesion?\n\nWe are particularly interested in the dual-modality (freeze + heat) technology and how it compares to our current radiofrequency ablation system.\n\nCould we schedule a demonstration at our facility? We perform approximately 150 ablation procedures annually.\n\nBest regards,\nDr. James Wilson, MD",
    "timestamp": "2025-12-10T10:30:00Z",
    "intent": "Technical",
    "priority": "High"
  },
  {
    "id": "email_002", 
    "fromName": "Dr. Sarah Chen",
    "fromEmail": "warmmilk21@gmail.com",
    "subject": "Request for Clinical Evidence and FDA Clearance Information",
    "content": "Hello,\n\nI'm Dr. Sarah Chen, Director of Interventional Radiology at University Hospital. We're considering adding cryoablation capabilities to our interventional suite.\n\nCould you please provide:\n\n1. FDA clearance documentation for the AI Epic™ system\n2. Published clinical studies and outcomes data\n3. Comparison studies vs. radiofrequency and microwave ablation\n4. Training requirements and certification process\n5. Pricing and leasing options\n\nWe currently perform about 200 tumor ablations per year using RF and microwave systems. We're particularly interested in the reported 95% complete ablation rate.\n\nThank you for your time.\n\nDr. Sarah Chen\nDirector of Interventional Radiology\nUniversity Hospital",
    "timestamp": "2025-12-10T14:15:00Z", 
    "intent": "Sales",
    "priority": "Medium"
  }
]